gravityCase/Pe1Ra85/system/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\ 
| =========                 |                                             | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       | 
|  \\    /   O peration     | Version:  2.4.0                             | 
|   \\  /    A nd           | Web:      www.openfoam.com                  | 
|    \\/     M anipulation  |                                             | 
\*-----------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 
lx0 -1.25e-2;
lx 1.25e-2;
ly 5e-2;
ly0 1.5e-3;
lz 3e-3;
lz0 -3e-4;
lz00 -3e-3;

Nx  100;
Ny	192;
Ny0	6;
Nz	70;//lz/dz
Nz0 7;
Nz00 63;//lz00-lz0/dz

vertices
(
	(    $lx0     0        $lz0)
    (    $lx     0       $lz0)
    (    $lx     $ly0        $lz0)
	(    $lx0     $ly0        $lz0)
	(    $lx0     0        0)
    (    $lx     0       0)
    (    $lx     $ly0        0)
	(    $lx0     $ly0        0)
    (    $lx     0       $lz)
    (    $lx     $ly0        $lz)
	(    $lx0     $ly0        $lz)
	(    $lx0     0        $lz)
    (    $lx     $ly        $lz0)
	(    $lx0     $ly        $lz0)
    (    $lx     $ly        0)
	(    $lx0     $ly        0)
    (    $lx     $ly       $lz)
	(    $lx0     $ly        $lz)
	(    $lx0     0        $lz00)
    (    $lx     0       $lz00)
    (    $lx     $ly0        $lz00)
	(    $lx0     $ly0        $lz00)
    (    $lx     $ly        $lz00)
	(    $lx0     $ly        $lz00)	
);

edges
(
   spline 0 1 (
		(	-0.0125	0	-0.00030000	)
(	-0.012475	0	-0.00030000	)
(	-0.01245	0	-0.00030000	)
(	-0.012425	0	-0.00030000	)
(	-0.0124	0	-0.00030000	)
(	-0.012375	0	-0.00030000	)
(	-0.01235	0	-0.00030000	)
(	-0.012325	0	-0.00030000	)
(	-0.0123	0	-0.00030000	)
(	-0.012275	0	-0.00030000	)
(	-0.01225	0	-0.00030000	)
(	-0.012225	0	-0.00030000	)
(	-0.0122	0	-0.00030000	)
(	-0.012175	0	-0.00030000	)
(	-0.01215	0	-0.00030000	)
(	-0.012125	0	-0.00030000	)
(	-0.0121	0	-0.00030000	)
(	-0.012075	0	-0.00030000	)
(	-0.01205	0	-0.00030000	)
(	-0.012025	0	-0.00030000	)
(	-0.012	0	-0.00030000	)
(	-0.011975	0	-0.00030000	)
(	-0.01195	0	-0.00030000	)
(	-0.011925	0	-0.00030000	)
(	-0.0119	0	-0.00030000	)
(	-0.011875	0	-0.00030000	)
(	-0.01185	0	-0.00030000	)
(	-0.011825	0	-0.00030000	)
(	-0.0118	0	-0.00030000	)
(	-0.011775	0	-0.00030000	)
(	-0.01175	0	-0.00030000	)
(	-0.011725	0	-0.00030000	)
(	-0.0117	0	-0.00030000	)
(	-0.011675	0	-0.00030000	)
(	-0.01165	0	-0.00030000	)
(	-0.011625	0	-0.00030000	)
(	-0.0116	0	-0.00030000	)
(	-0.011575	0	-0.00030000	)
(	-0.01155	0	-0.00030000	)
(	-0.011525	0	-0.00030000	)
(	-0.0115	0	-0.00030000	)
(	-0.011475	0	-0.00030000	)
(	-0.01145	0	-0.00030000	)
(	-0.011425	0	-0.00030000	)
(	-0.0114	0	-0.00030000	)
(	-0.011375	0	-0.00030000	)
(	-0.01135	0	-0.00030000	)
(	-0.011325	0	-0.00030000	)
(	-0.0113	0	-0.00030000	)
(	-0.011275	0	-0.00030000	)
(	-0.01125	0	-0.00030000	)
(	-0.011225	0	-0.00030000	)
(	-0.0112	0	-0.00030000	)
(	-0.011175	0	-0.00030000	)
(	-0.01115	0	-0.00030000	)
(	-0.011125	0	-0.00030000	)
(	-0.0111	0	-0.00030000	)
(	-0.011075	0	-0.00030000	)
(	-0.01105	0	-0.00030000	)
(	-0.011025	0	-0.00030000	)
(	-0.011	0	-0.00030000	)
(	-0.010975	0	-0.00030000	)
(	-0.01095	0	-0.00030000	)
(	-0.010925	0	-0.00030000	)
(	-0.0109	0	-0.00030000	)
(	-0.010875	0	-0.00030000	)
(	-0.01085	0	-0.00030000	)
(	-0.010825	0	-0.00030000	)
(	-0.0108	0	-0.00030000	)
(	-0.010775	0	-0.00030000	)
(	-0.01075	0	-0.00030000	)
(	-0.010725	0	-0.00030000	)
(	-0.0107	0	-0.00030000	)
(	-0.010675	0	-0.00030000	)
(	-0.01065	0	-0.00030000	)
(	-0.010625	0	-0.00030000	)
(	-0.0106	0	-0.00030000	)
(	-0.010575	0	-0.00030000	)
(	-0.01055	0	-0.00030000	)
(	-0.010525	0	-0.00030000	)
(	-0.0105	0	-0.00030000	)
(	-0.010475	0	-0.00030000	)
(	-0.01045	0	-0.00030000	)
(	-0.010425	0	-0.00030000	)
(	-0.0104	0	-0.00030000	)
(	-0.010375	0	-0.00030000	)
(	-0.01035	0	-0.00030000	)
(	-0.010325	0	-0.00030000	)
(	-0.0103	0	-0.00030000	)
(	-0.010275	0	-0.00030000	)
(	-0.01025	0	-0.00030000	)
(	-0.010225	0	-0.00030000	)
(	-0.0102	0	-0.00030000	)
(	-0.010175	0	-0.00030000	)
(	-0.01015	0	-0.00030000	)
(	-0.010125	0	-0.00030000	)
(	-0.0101	0	-0.00030000	)
(	-0.010075	0	-0.00030000	)
(	-0.01005	0	-0.00030000	)
(	-0.010025	0	-0.00030000	)
...
		)
		spline 4 5 (
(	-0.0125	0	0	)
(	-0.012475	0	0	)
(	-0.01245	0	0	)
(	-0.012425	0	0	)
(	-0.0124	0	0	)
(	-0.012375	0	0	)
(	-0.01235	0	0	)
(	-0.012325	0	0	)
(	-0.0123	0	0	)
(	-0.012275	0	0	)
(	-0.01225	0	0	)
(	-0.012225	0	0	)
(	-0.0122	0	0	)
(	-0.012175	0	0	)
(	-0.01215	0	0	)
(	-0.012125	0	0	)
(	-0.0121	0	0	)
(	-0.012075	0	0	)
(	-0.01205	0	0	)
(	-0.012025	0	0	)
(	-0.012	0	0	)
(	-0.011975	0	0	)
(	-0.01195	0	0	)
(	-0.011925	0	0	)
(	-0.0119	0	0	)
(	-0.011875	0	0	)
(	-0.01185	0	0	)
(	-0.011825	0	0	)
(	-0.0118	0	0	)
(	-0.011775	0	0	)
(	-0.01175	0	0	)
(	-0.011725	0	0	)
(	-0.0117	0	0	)
(	-0.011675	0	0	)
(	-0.01165	0	0	)
(	-0.011625	0	0	)
(	-0.0116	0	0	)
(	-0.011575	0	0	)
(	-0.01155	0	0	)
(	-0.011525	0	0	)
(	-0.0115	0	0	)
(	-0.011475	0	0	)
(	-0.01145	0	0	)
(	-0.011425	0	0	)
(	-0.0114	0	0	)
(	-0.011375	0	0	)
(	-0.01135	0	0	)
(	-0.011325	0	0	)
(	-0.0113	0	0	)
(	-0.011275	0	0	)
(	-0.01125	0	0	)
(	-0.011225	0	0	)
(	-0.0112	0	0	)
(	-0.011175	0	0	)
(	-0.01115	0	0	)
(	-0.011125	0	0	)
(	-0.0111	0	0	)
(	-0.011075	0	0	)
(	-0.01105	0	0	)
(	-0.011025	0	0	)
(	-0.011	0	0	)
(	-0.010975	0	0	)
(	-0.01095	0	0	)
(	-0.010925	0	0	)
(	-0.0109	0	0	)
(	-0.010875	0	0	)
(	-0.01085	0	0	)
(	-0.010825	0	0	)
(	-0.0108	0	0	)
(	-0.010775	0	0	)
(	-0.01075	0	0	)
(	-0.010725	0	0	)
(	-0.0107	0	0	)
(	-0.010675	0	0	)
(	-0.01065	0	0	)
(	-0.010625	0	0	)
(	-0.0106	0	0	)
(	-0.010575	0	0	)
(	-0.01055	0	0	)
(	-0.010525	0	0	)
(	-0.0105	0	0	)
(	-0.010475	0	0	)
(	-0.01045	0	0	)
(	-0.010425	0	0	)
(	-0.0104	0	0	)
(	-0.010375	0	0	)
(	-0.01035	0	0	)
(	-0.010325	0	0	)
(	-0.0103	0	0	)
(	-0.010275	0	0	)
(	-0.01025	0	0	)
(	-0.010225	0	0	)
(	-0.0102	0	0	)
(	-0.010175	0	0	)
(	-0.01015	0	0	)
(	-0.010125	0	0	)
(	-0.0101	0	0	)
(	-0.010075	0	0	)
(	-0.01005	0	0	)
(	-0.010025	0	0	)
...
);

blocks
(
	hex (0  1  2  3  4  5  6  7)  v0inlet ($Nx $Ny0 $Nz0)     simpleGrading (1 1 1)
	hex (4  5  6  7  11 8  9 10 )  ($Nx $Ny0 $Nz)    simpleGrading (1 1 1)
	hex (3  2 12 13  7  6 14 15)  v0outlet ($Nx $Ny $Nz0)     simpleGrading (1 1 1)
	hex (7 6 14 15   10 9 16 17 )  ($Nx $Ny $Nz)  simpleGrading (1 1 1)
	hex (18 19 20 21 0 1 2 3)  ($Nx $Ny0 $Nz00)  simpleGrading (1 1 1)
	hex (21 20 22 23 3 2 12 13)  ($Nx $Ny $Nz00)  simpleGrading (1 1 1)
);

boundary
(
    walls
    {
      type wall;
      faces
      (
        ( 1 2 6 5)
        ( 5 6 9 8)
		( 2 12 14 6)
        ( 6 14 16 9)
		(1 19 20 2)
		(2 20 22 12)
        ( 4 7 3 0)
        ( 11 10 7 4)
		( 10 17 15 7)
        ( 7 15 13 3)
		(3 21 18 0)
		(13 23 21 3)
		(18 19 1 0)//inletwall
		(4 5 8 11 )		
      );
    }

    up
    {
      type wall;
      faces
      (
        (8  9  10  11)
        (9  16  17  10)
      );
    }

    down
    {
      type wall;
      faces
      (
	    (18 21 20 19)
        (21 23 22 20)
      );
    }
	
    inlet
    {
      type patch;
      faces
      (
        (0 1 5 4)
		
      );
    }

    outlet
    {
      type patch;
      faces
      (
        (12 13 15 14)
        (14 15 17 16)
		(13 12 22 23)
      );
    }
);
mergePatchPairs 
(
);
// ********************************************************************* //
