gravityCase/Pe1Ra85/constant/chemicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beta             beta  [0 0 0 0 0 0 0] 1.0;
reactionRate     reactionRate [0 1 -1 0 0 0 0] 5E-04;
Yeq              Yeq [1 -3 0 0 0 0 0] 317.6;
Y0               Y0 [1 -3 0 0 0 0 0] 285.6;

// ************************************************************************* //
