gravityCase/Pe1Ra85/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
	grad(epsSolid)  leastSquares;
	grad(U) 		cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phiByEpsf,U)    Gauss linearUpwind grad(U);
    //div(phi,e)          bounded Gauss limitedLinear 1;

    div(phiv,p)         bounded Gauss limitedLinear 1;
    div(phi,K)          bounded Gauss limitedLinear 1;

    //div(phi,Y)          bounded Gauss upwind;
	div(phi,Y)			bounded Gauss limitedLinear 1;
	div(phiR,eps)		bounded Gauss limitedLinear 1;
	div(phiR)		bounded Gauss limitedLinear 1;
	div(((reactionRate*Yun)*(-grad(eps)|(mag(grad(eps))+(1e-13|pow(average(V),0.333333))))))   Gauss linear;
	div((((reactionRate*Yun)*(-grad(eps)|(mag(grad(eps))+(1e-13|pow(average(V),0.333333)))))*eps))  Gauss linear;
	div(((reactionRate*Yun)*(-grad(eps)|(mag(grad(eps))+deltaN))))   Gauss linear;
	div((((reactionRate*Yun)*(-grad(eps)|(mag(grad(eps))+deltaN)))*eps))  Gauss linear;
	div((reactionRate*(-grad(eps)|(mag(grad(eps))+(1e-13|pow(average(V),0.333333))))))   Gauss linear;
	div(((reactionRate*(-grad(eps)|(mag(grad(eps))+(1e-13|pow(average(V),0.333333)))))*eps))  Gauss linear;
	div((reactionRate*(-grad(eps)|(mag(grad(eps))+deltaN))))   Gauss linear;
	div(((reactionRate*(-grad(eps)|(mag(grad(eps))+deltaN)))*eps))  Gauss linear;
}

laplacianSchemes
{
    //default         Gauss linear limited corrected 0.33;
	default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    //default         limited corrected 0.33;
	default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
